name: "logreg"
platform: "onnxruntime_onnx"
max_batch_size: 128
dynamic_batching {
  max_queue_delay_microseconds: 1000
}

input [
  {
    name: "X"
    data_type: TYPE_FP32
    dims: [ 17874 ]
  }
]

output [
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [ 1 ]
    reshape {
      shape: [ ]
    }
  },
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
